[
  {
    "id": "64352bd9ca5f89e91e7c195d",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Google_2015_logo.svg/2560px-Google_2015_logo.svg.png",
    "job_title": "Software Engineer",
    "company_name": "Google",
    "remote_or_onsite": "Onsite",
    "location": "Mountain View, CA",
    "fulltime_or_parttime": "Full-time",
    "salary": "$120,000 - $150,000",
    "job_description": "s a Software Engineer at Google, you will be responsible for designing, developing, and maintaining software applications and services. You will work with a team of talented engineers and collaborate with cross-functional teams to define and implement new features and functionality. You will stay up-to-date with the latest trends and best practices in software engineering and contribute to the continuous improvement of our processes and tools. You will have the opportunity to work on exciting projects that have a significant impact on users worldwide.",
    "job_responsibility": "Design, develop, and maintain software applications and services, collaborate with cross-functional teams to define and implement new features and functionality, and stay up-to-date with the latest trends and best practices in software engineering.",
    "educational_requirements": "Bachelor's degree in Computer Science or a related field",
    "experiences": "Minimum 5 years of experience in software engineering",
    "contact_information": {
      "phone": "555-9012",
      "email": "jobs@google.com"
    },
    "isApplied": false
  },
  {
    "id": "64352bd9f3deee7f4ce353d7",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/08/Netflix_2015_logo.svg/2560px-Netflix_2015_logo.svg.png",
    "job_title": "Senior Software Engineer",
    "company_name": "Netflix",
    "remote_or_onsite": "Remote",
    "location": "Any",
    "fulltime_or_parttime": "Full-time",
    "salary": "$150,000 - $200,000",
    "job_description": "We are looking for a Senior Software Engineer to join our team and help us build the next generation of streaming technology, Design and implement new features and functionality, Collaborate with cross-functional teams to deliver high-quality software.",
    "job_responsibility": "Design and implement new features and functionality, collaborate with cross-functional teams to deliver high-quality software, and stay up-to-date with the latest trends and best practices in software development.",
    "educational_requirements": "Bachelor's degree in Computer Science or a related field",
    "experiences": "Minimum 8 years of experience in software development",
    "contact_information": {
      "phone": "555-5555",
      "email": "jobs@netflix.com"
    },
    "isApplied": false
  },

  {
    "id": "64352bd924e189d301f78fa9",
    "company_logo": "https://cdn.worldvectorlogo.com/logos/tesla-9.svg",
    "job_title": "Software Engineer",
    "company_name": "Tesla",
    "remote_or_onsite": "Onsite",
    "location": "Fremont, CA",
    "fulltime_or_parttime": "Full-time",
    "salary": "$100,000 - $130,000",
    "job_description": "As a Software Engineer at Tesla, you will be responsible for designing and implementing software solutions for a variety of projects. You will work with a talented team of engineers to develop innovative solutions for our products. You will also stay up-to-date with the latest trends and best practices in software development.",
    "job_responsibility": "Design and implement software solutions for a variety of projects, collaborate with cross-functional teams to deliver high-quality software, and stay up-to-date with the latest trends and best practices in software development.",
    "educational_requirements": "Bachelor's degree in Computer Science or a related field",
    "experiences": "Minimum 5 years of experience in software development",
    "contact_information": {
      "phone": "555-1234",
      "email": "jobs@tesla.com"
    },
    "isApplied": false
  },

  {
    "id": "64352bd9d7237a2786bb58a8",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/a/a9/Amazon_logo.svg",
    "job_title": "Software Development Engineer",
    "company_name": "Amazon",
    "remote_or_onsite": "Remote",
    "location": "Any",
    "fulltime_or_parttime": "Full-time",
    "salary": "$120,000 - $160,000",
    "job_description": "As a Software Development Engineer at Amazon, you will be responsible for designing and developing scalable and reliable distributed systems. You will work closely with cross-functional teams to deliver high-quality software that meets the needs of our customers. In addition, you will participate in the full software development lifecycle, from design and development to testing and deployment.",
    "job_responsibility": "Design and develop distributed systems, collaborate with cross-functional teams to deliver high-quality software, and participate in the full software development lifecycle.",
    "educational_requirements": "Bachelor's degree in Computer Science or a related field",
    "experiences": "Minimum 3 years of experience in software development",
    "contact_information": {
      "phone": "555-1234",
      "email": "jobs@amazon.com"
    },
    "isApplied": false
  },

  {
    "id": "64352bd9d9ed8a68bfcc8add",
    "company_logo": "https://www.vectorlogo.zone/logos/apple/apple-ar21.png",
    "job_title": "iOS Developer",
    "company_name": "Apple",
    "remote_or_onsite": "Onsite",
    "location": "Cupertino, CA",
    "fulltime_or_parttime": "Full-time",
    "salary": "$120,000 - $160,000",
    "job_description": "As an iOS Developer at Apple, you will be responsible for designing and developing innovative apps for our platform. You will work closely with cross-functional teams to deliver high-quality software that meets the needs of our users. In addition, you will stay up-to-date with the latest trends and best practices in iOS development to ensure that our apps are always cutting-edge.",
    "job_responsibility": "Design and develop iOS apps that meet the needs of our users and deliver an exceptional user experience. Collaborate with cross-functional teams, including product managers, designers, and other developers, to deliver high-quality software on time and within budget. Stay up-to-date with the latest trends and best practices in iOS development, and bring new ideas to the team to continuously improve our apps",
    "experiences": "Minimum 5 years of experience in iOS development",
    "contact_information": {
      "phone": "555-1234",
      "email": "jobs@apple.com"
    },
    "isApplied": false
  },
  {
    "id": "64352bd9d9ed8a78bfcc5add",
    "company_logo": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b8/YouTube_Logo_2017.svg/1024px-YouTube_Logo_2017.svg.png",
    "job_title": "Machine Learning Engineer",
    "company_name": "YouTube",
    "remote_or_onsite": "Remote",
    "location": "Any",
    "fulltime_or_parttime": "Full-time",
    "salary": "$120,000 - $150,000",
    "job_description": "We are seeking a Machine Learning Engineer to join our team and help us build state-of-the-art algorithms for content recommendations. The ideal candidate has a strong background in machine learning, data analysis, and software development.",
    "job_responsibility": "Develop and deploy machine learning models to analyze large volumes of data and generate insights that improve the performance of the content recommendation systems. Stay up-to-date with the latest research in machine learning and incorporate new techniques, frameworks, and tools into existing systems. Communicate findings and insights to stakeholders.",
    "educational_requirements": "Master's degree in Computer Science or a related field",
    "experiences": "Minimum 3 years of experience in machine learning",
    "contact_information": {
      "phone": "555-5555",
      "email": "jobs@youtube.com"
    },
    "isApplied": false
  }
]
